---
kind: type
id: T:Autodesk.Revit.DB.ExternalDefinitionCreationOptions
source: html/1cd9e425-23a3-04f8-c130-4d4a799abd13.htm
---
# Autodesk.Revit.DB.ExternalDefinitionCreationOptions

An option class used for creating a new shared parameter definition, including options such as name, type, visibility,
 Guid description and modifiable flag.

## Syntax (C#)
```csharp
public class ExternalDefinitionCreationOptions : IDisposable
```